''' _________________________________________________________________ 72
4) Создать программу которая будет выводить 3 любых сообщения
(x), по которому можно обращаться к трижды вызвать функцию pr)int(x),
по которому можно обращаться к )), но все сообщения выведутся в одну
строку.
'''
def main():
    for i in range(3):
        print('сообщения', i, end = '! ')

main()