''' _________________________________________________________________ 72
2) Создать программу для вычисления площади круга. Программа должна 
запрашивать пользователя ввести радиус окружности, посчитать и вывести
на экран площадь.
'''
def main():
    r = float(input())
    print('S = ', 3.1415 * (r * r)) 

main()
#  dasdasd asd as